"""
2. Реализовать проект расчета суммарного расхода ткани на производство одежды.
   Основная сущность (класс) этого проекта — одежда, которая может иметь определенное название.
   К типам одежды в этом проекте относятся пальто и костюм. У этих типов одежды существуют
   параметры: размер (для пальто) и рост (для костюма). Это могут быть обычные числа: V и H, соответственно.
   Для определения расхода ткани по каждому типу одежды использовать формулы:
   для пальто (V/6.5 + 0.5), для костюма (2*H + 0.3). Проверить работу этих методов на реальных данных.
   Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания:
   реализовать абстрактные классы для основных классов проекта, проверить на практике работу декоратора @property.
"""

from abc import ABC, abstractmethod


class Clothes(ABC):
    @abstractmethod
    def material(self):
        pass


class Coat(Clothes):
    size: int

    def __init__(self, size):
        self.size = size

    @property
    def material(self):
        return self.size / 6.5 + 0.5


class Suit(Clothes):
    height: int

    def __init__(self, height):
        self.height = height

    @property
    def material(self):
        return self.height * 2 / 100 + 0.3


c = Coat(48)
s = Suit(173)
print(f"На пальто размера {c.size} понадобится ткани: {c.material:.2f}")
print(f"На костюм для роста {s.height} понадобится ткани: {s.material:.2f}")